{
  "category": "Category",
  "price": "Price",
  "quantity": "Quantity",
  "description": "Description",
  "rating": "Rating",
  "addToCart": "Add to Cart",
  "cakeNotFound": "Cake not found.",
  "cakeIdNotProvided": "Cake ID not provided.",
  "cakename_1": "Traditional Cheesecake",
  "cakename_2": "Poppy Seed Cake",
  "cakename_3": "Swan Puffs",
  "cakename_4": "Papal Cream Cake",
  "cakename_5": "Wuzetka",
  "cakename_6": "Brownie",
  "cakename_7": "Chocolate Cupcakes",
  "cakename_8": "Berry Cake",
  "cakename_9": "Strawberry Cake",
  "cakename_10": "Raspberry Cloud Cake",
  "cakename_11": "Gluten-Free Carrot Cake",
  "cakename_12": "Gluten-Free Lemon Bundt Cake",
  "cakename_13": "Vegan Cashew Cheesecake",
  "cakename_14": "Gluten-Free Apple Pie",
  "cakecategory_1": "Chocolate Cakes",
  "cakecategory_2": "Traditional Cakes",
  "cakecategory_3": "Seasonal Cakes",
  "cakecategory_4": "Gluten-Free Cakes",
  "cake_1": "Traditional Cheesecake is a classic confectionery delight that enjoys great popularity due to its unique flavor and texture. It is a delicate and fluffy cheesecake consisting of several layers. The main ingredient in a traditional cheesecake is cottage cheese, which gives it its characteristic texture and slightly tangy taste. The cottage cheese is carefully grated or blended to achieve a smooth consistency without lumps. Additionally, the cake is made with eggs, sugar, flour, and usually a touch of milk, which help give the cake its proper structure and sweetness. Traditional cheesecake features a distinctive crisp crust on the bottom, which serves as the base for the rest of the cake. Often, the crust is made from shortcrust pastry or biscuits, which add extra texture and flavor. On top of the crust, a layer of cheesecake filling is placed. This layer is smooth, creamy, and slightly moist. It may have a subtle hint of vanilla or lemon flavor, adding delicacy and freshness to the taste. Traditional cheesecake is baked at a moderately low temperature to ensure even and gentle baking. Once baked, the cake should be fluffy with a lightly browned top. After cooling, traditional cheesecake is often decorated with delicate chocolate shavings, whipped cream, or fruits, enhancing its aesthetic appeal and adding extra flavor. Traditional cheesecake has a unique creamy taste that is simultaneously lightly sweet and mildly tangy. Its texture is delicate and silky, melting in your mouth. It is a classic confectionery delight that satisfies the cravings of dessert lovers and is perfect for both everyday indulgence and special occasions.",
  "cake_2": "Poppy Seed Cake is a unique pastry that delights with its extraordinary flavor and distinctive texture. It is a traditional Polish cake made with poppy seeds, giving it an intense aroma and a unique appearance. Makowiec consists of a fluffy and delicate yeast dough that is filled with an aromatic filling made from poppy seeds, sugar, milk, nuts, and spices. The poppy seed filling is thick, full of poppy seeds, and has a sweet-nutty taste. Additionally, some variations of makowiec may include additions such as raisins, nuts, or orange zest, which add extra flavors and textures. Makowiec is traditionally prepared for holidays such as Christmas and Easter but is also enjoyed year-round as a delicious and special dessert. It is served in slices, often garnished with a light dusting of powdered sugar or icing, adding to its aesthetic appeal. Every bite of makowiec is a true feast for the palate. The yeast dough is soft and fluffy, while the poppy seed filling provides an intense flavor and a slight crunch from the poppy seeds. Makowiec is aromatic, sweet, and at the same time has a subtly savory note that pairs well with a cup of hot coffee or tea. Makowiec is not only a tasty dessert but also an important element of Polish culinary tradition. Its unique flavor and distinctive appearance make it an integral part of many holiday tables and family gatherings.",
  "cake_3": "Swan's Puff, also known as a white puff doll or white puff, is an elegant and delicate confectionery work of art. It is a dessert that stands out with its beautiful appearance and lightness. Swan's Puff consists mainly of white meringue, which is shaped into the form of a swan. The meringue is light, fluffy, and has a texture reminiscent of a puff. Special molds are used to create delicate details of the swan, such as the neck, wings, and tail. This dessert is often adorned with sugar or chocolate elements, such as eyes or feathers, to add even more elegance and realism. Swan's Puff is usually served on special occasions such as weddings, family celebrations, or elegant gatherings. Its subtle appearance and unique charm capture attention and serve as a centerpiece on any table. In terms of flavor, Swan's Puff is typically prepared with meringue that has a delicate vanilla or lemon taste. Its texture is incredibly delicate, melting in the mouth and leaving a sense of lightness and pleasure. Swan's Puff is not only a dessert but also a display of confectionery craftsmanship. Its creation requires precision and skill to achieve a perfectly shaped and aesthetically pleasing swan. It is a true work of art that evokes admiration and delight, both for its visual appeal and heavenly lightness of taste.",
  "cake_4": "Papal Cream Cake, also known as \"Papieska\" or \"Papieżka\" is a famous cream cake that gained popularity due to its association with Pope John Paul II. It is a traditional Polish cake consisting of two layers of flaky puff pastry and a rich vanilla cream filling. Papal Cream Cake starts with a base of crispy and delicate puff pastry that is baked to a golden color. The pastry is then sliced in half, and a thick vanilla cream is placed between the two layers. The cream is made from milk, egg yolks, sugar, and flour, cooked to a thick consistency. It has a delicate vanilla flavor and a creamy texture that pairs perfectly with the crispy pastry. After the cream is added, the top layer of puff pastry is lightly dusted with powdered sugar or covered with a layer of icing, adding elegance and aesthetic appeal to the cake. Papal Cream Cake is often adorned with three characteristic chocolate lines on the top as well. It has a unique taste and texture that combines the crispness of the puff pastry with the creamy delicacy of the vanilla cream. It is a cake that tastes delicious when served warm but is also enjoyable when chilled in the refrigerator. It is frequently served as a dessert or a treat for special occasions as well as everyday pleasures. Papal Cream Cake not only delights the palate but also holds significance in Polish cuisine and culture. Its name is associated with Pope John Paul II, who expressed his fondness for this cake and often enjoyed it during his visit to Poland. The cake has become a symbol that is linked to the Pope and his love for Polish cuisine.",
  "cake_5": "Wuzetka, also known as \"Krówka\" or Choux Pastry Cake, is a popular Polish cake that consists of layers of delicate choux pastry, whipped cream filling, and cocoa. Wuzetka starts with a base of crispy choux pastry that is baked to a golden color. The pastry is then gently crumbled, creating characteristic \"wuzety\" or \"krówki\" (caramelized bits). Whipped cream filling, made from thick cream, powdered sugar, and vanilla, is spread over the crumbled pastry. Another layer of choux pastry is placed on top of the cream, adding another element of crispiness. The cake is garnished with cocoa, which adds a subtle chocolatey note. Wuzetka has a light and fluffy texture, with a distinct contrast between the crispy choux pastry and the creamy filling. It is a dessert that tastes delightful when served cold, as the cream sets, creating a creamy yet crunchy sensation. Wuzetka is popular on Polish tables during various occasions such as birthdays, name days, or holidays, but it also makes for a delicious sweet treat on any given day. Wuzetka is not only a delicious dessert but also visually appealing. Its distinctive appearance, with layers of choux pastry and whipped cream, makes it not only tasty but also visually enticing. It is a cake that will surely satisfy lovers of delicate and creamy sweets.",
  "cake_6": "Brownie is a delicious, chocolatey cake with a dense consistency and intense flavor. It is a popular dessert that enjoys great popularity worldwide. Brownie is typically made with a few basic ingredients such as chocolate, butter, eggs, sugar, and flour. The chocolate is melted with butter, creating a smooth and rich chocolate mixture. Eggs, sugar, and flour are then added to achieve a uniform and dense batter. Additionally, nuts, chocolate chunks, or other add-ins can often be included to add flavor and texture to the brownie. Brownie is baked in a rectangular pan and, once baked, has a crispy crust on the outside and a soft, moist structure on the inside. This is characteristic of this dessert and makes it incredibly appealing to chocolate lovers. Brownie is often served in slices, which can be drizzled with chocolate sauce or dusted with powdered sugar. It is an excellent companion to coffee, tea, or ice cream. It can also be served with a scoop of vanilla ice cream or whipped cream to create an even more indulgent flavor combination. What sets brownie apart is its intense chocolate flavor and a texture that combines delicacy with density. It is a dessert that tastes great on various occasions, from family gatherings to parties or celebrations. Brownie is also a great choice if you're craving something sweet and chocolaty.",
  "cake_7": "Chocolate Cupcakes are small, exceptionally tasty, and seductive treats for chocolate lovers. They are perfect mini-cakes that captivate not only with their intense flavor but also their beautiful appearance. Chocolate Cupcakes are made from a rich chocolate batter that is fluffy, moist, and has an intense chocolate aroma. The batter is poured into cupcake molds and baked to achieve a perfect texture and golden color. After baking, Chocolate Cupcakes are adorned with various frostings or chocolate drizzles. They can be decorated with whipped cream, chocolate chunks, chocolate sprinkles, colorful sprinkles, or sugar flowers, adding beauty and uniqueness to them. Chocolate Cupcakes are perfect as small indulgences for parties, birthday celebrations, baby showers, or simply as a sweet treat for oneself. Their small size makes them ideal for individual servings, and it's a wonderful way to savor the taste of chocolate in portions. The flavor of Chocolate Cupcakes is incredibly tempting, with a deep chocolate taste that literally melts in the mouth. They are perfectly moist and have a velvety texture, making them incredibly satisfying for the palate. Chocolate Cupcakes are little delights that bring joy and satisfy sweet cravings. Regardless of the occasion, Chocolate Cupcakes are always an excellent choice for chocolate lovers and confectionery delights.",
  "cake_8": "Blackberry Cake is a delicious dessert filled with juicy blackberries. It's the perfect proposition for fans of fruity flavors and sweet treats. The Blackberry Cake consists of a delicate, moist sponge or a crumbly crust that is filled with fresh blackberries. The blackberries are evenly arranged on the cake, creating an aromatic and colorful fruit layer. Often, a delicate sprinkle or crumble topping is added on top of the Blackberry Cake, providing additional texture and flavor. Depending on the recipe, the Blackberry Cake can be served warm or chilled in the refrigerator. It's excellent as a dessert on hot summer days or as a sweet snack any time of the year. The taste of the Blackberry Cake harmonizes sweetness with the tartness of the blackberries. Juicy blackberries melt in your mouth, adding freshness and natural flavor. The Blackberry Cake is typically delicate and slightly tangy, perfectly contrasting with the sweet sponge or crust. It's ideal for various occasions, from family gatherings to parties and celebrations. It can be served on its own or with whipped cream, vanilla ice cream, or chocolate sauce for an even greater taste pleasure. Blackberries are delicious fruits, and the Blackberry Cake allows them to shine in all their glory. This unique cake enjoys popularity due to its simplicity, deliciousness, and natural ingredients.",
  "cake_9": "Strawberry Cake is a summer dessert that fully embraces the freshness and sweetness of these delicious fruits. It's the perfect cake for strawberry lovers and fans of sweet, fruity flavors. The Strawberry Cake can come in various variations, but most commonly, it consists of a light sponge or a crumbly crust filled with fresh strawberries. The strawberries are arranged on the cake or placed on a creamy layer, creating a colorful and aromatic fruit layer. Additionally, the Strawberry Cake is often drizzled with a delicate jelly-like gelatin sauce, adding extra freshness and visual appeal. It can also be adorned with whipped cream, sprinkles, or powdered sugar to enhance the taste and appearance of the strawberry dessert. The taste of the Strawberry Cake is incredibly juicy, sweet, and refreshing. Strawberries impart a natural aroma and delicate acidity to the cake, which complements the lightness and sweetness of the pastry. It's the perfect cake for warm summer days when strawberries are at their peak freshness. The Strawberry Cake is suitable for various occasions, from picnics and barbecues to birthdays and name days. It's an excellent choice for those who love strawberries and want to indulge in their flavor in the form of a dessert. The Strawberry Cake is visually appealing and provides not only a delightful taste experience but also brings smiles to the faces of everyone who tries it. It's the ideal cake for those craving a sweet and fruity delight for their taste buds.",
  "cake_10": "Raspberry Cloud Cake is a true delight for raspberry lovers and fans of light, fluffy desserts. It's a delicate cake that literally melts in your mouth and captivates with its intense raspberry flavor. The Raspberry Cloud Cake consists of a delicate sponge cake that is moistened with raspberry juice or syrup to achieve an extra fruity taste. Then, a fluffy and light raspberry cream is spread over the sponge cake, made from raspberries, cream, sugar, and gelatin. The cream is gently spread, creating a layer of intense raspberry flavor. The Raspberry Cloud Cake is often adorned with fresh raspberries on top, adding beauty and freshness to this wonderful dessert. It can also be dusted with powdered sugar or adorned with whipped cream to enhance the taste experience and the cake's aesthetic appeal. The taste of the Raspberry Cloud Cake is fruity, sweet, and refreshing. Raspberries impart an intense flavor and acidity to the cake, which perfectly complements the delicate sponge and fluffy cream. It's the perfect cake for warm summer days when raspberries are in season and have the most juicy flavor. The Raspberry Cloud Cake is perfect for various occasions, from family gatherings to parties and celebrations. Its unique flavor and beautiful appearance make it not only a delicious dessert but also an impressive centerpiece on the table. Raspberry Cloud Cake is a sweet indulgence that seduces the palate with the taste of raspberries. It's a cake that brings joy and allows for the utmost enjoyment of fruity delights.",
  "cake_11": "Gluten-Free Carrot Cake is a delicious and healthier version of the traditional carrot cake, perfect for individuals with gluten intolerance or celiac disease. It is a moist and aromatic cake that delights with its intense carrot flavor and pleasant texture. This cake is prepared using a blend of gluten-free flour, such as rice flour, potato flour, or almond flour, which replaces the traditional wheat flour. Additionally, the cake includes grated carrots, eggs, sugar, vegetable oil, spices like cinnamon, nutmeg, and ginger, as well as additional ingredients such as raisins, nuts, or sunflower seeds. As a result, we obtain a carrot cake with a beautiful orange color that is moist, fluffy, and rich in flavor. Carrots add sweetness and natural juiciness, while the spices give it a distinctive aroma and a hint of warmth. Gluten-Free Carrot Cake is typically adorned with cream cheese frosting or cream cheese icing, which complements its flavor perfectly. This cake is ideal for various occasions, from family gatherings to birthdays or holidays. It can be served warm or chilled in the refrigerator. It is also popular as a healthier alternative to traditional carrot cake since it is gluten-free without compromising on taste and quality. Gluten-Free Carrot Cake is not only a tasty dessert but also an excellent source of fiber and nutrients due to the presence of carrots. Therefore, one can enjoy this delicious cake without worrying about gluten intolerance and experience the fullness of flavor and pleasure.",
  "cake_12": "Gluten-Free Lemon Bundt Cake is a unique and refreshing cake that is free from gluten but delights with its intense lemon flavor and soft, moist texture. It is the perfect choice for individuals with gluten intolerance or celiac disease who want to enjoy traditional flavors without sacrificing their favorite desserts. This cake is prepared using gluten-free flour, such as rice flour, potato flour, or almond flour, which replaces the traditional wheat flour. Additionally, the cake includes fresh lemon juice and zest, eggs, sugar, vegetable oil, and baking powder. These ingredients create an aromatic and juicy bundt cake that is perfect for serving on various occasions. Gluten-Free Lemon Bundt Cake has a light yellow color and a delicate lemon aroma. After baking, the cake acquires a fluffy and soft consistency that melts in the mouth. It is often drizzled with lemon glaze, which adds extra flavor and decorative finishing. This cake is ideal for afternoon tea, gatherings, birthdays, or other special occasions. Its fresh lemon taste makes it a perfect choice for summer days when we crave light and refreshing flavors. Gluten-Free Lemon Bundt Cake is proof that one can enjoy wonderful taste and texture in a cake even without the presence of gluten. It is a delightful dessert for all lemon lovers who value healthy and enjoyable eating.",
  "cake_13": "Vegan Cashew Cheesecake is a delicious dessert for individuals who prefer a plant-based diet or are seeking an alternative to traditional cheesecake. It is a meat- and dairy-free version of cheesecake that utilizes cashew nuts as a base ingredient. This vegan cheesecake consists of two main layers: a crust made from ground cashew nuts and dates, and a creamy cheesecake layer. The crust is typically prepared by combining ground cashew nuts, dates, coconut oil, and a pinch of salt, resulting in a crunchy and aromatic texture. The creamy cheesecake layer is usually made from soaked and blended cashew nuts, plant-based milk, maple syrup or another natural sweetener, lemon juice, and a hint of vanilla extract. The mixture is blended or processed until smooth and creamy in consistency. The cheesecake layer is then layered on top of the crust and chilled to set. Vegan Cashew Cheesecake has a delicate, creamy taste that pairs well with the natural notes of the cashew nuts. It can be served on its own or with toppings such as fresh fruits, chocolate drizzle, or plant-based whipped cream. This vegan cashew cheesecake is not only a tasty dessert but also a rich source of healthy fats, plant-based protein, and other nutrients. It is an excellent option for vegans, vegetarians, individuals with lactose intolerance, or anyone looking to try something different and delicious.",
  "cake_14": "Gluten-Free Apple Pie is a variation of the classic Polish dessert that is friendly to individuals with gluten intolerance or celiac disease. This delicious and aromatic apple pie will satisfy even the most discerning palates. Gluten-free apple pie consists of two main layers: a buttery crust made with gluten-free flour and a juicy apple filling. The crust is prepared using a blend of gluten-free flour, such as rice flour, corn flour, or potato flour, which replaces traditional wheat flour. Additionally, the crust may contain butter or a plant-based substitute, sugar, eggs, baking powder, and a pinch of salt. The crust is rolled out and used as both the base and the top crust of the apple pie. The filling of the gluten-free apple pie is typically made from sliced apples, sugar, cinnamon, and lemon juice. The apples are stewed or sautéed until they become soft and tender. They are then spread over the crust, and the second layer of crust is placed on top. The gluten-free apple pie is baked in the oven until it achieves a golden color and a crispy texture. It can be served warm or chilled in the refrigerator. Gluten-free apple pie is often sprinkled with cinnamon or powdered sugar before serving. This gluten-free apple pie delights with the delicious taste of apples, the pleasant aroma of cinnamon, and the buttery texture of the crust. It is the perfect pie for autumn evenings when apples are in season and have an intense flavor. It can be enjoyed on its own, with plant-based whipped cream, or with vanilla ice cream for an extra indulgence. Gluten-free apple pie is a tasty and satisfying dessert for anyone who wants to enjoy the traditional taste of apple pie without gluten. It is an excellent alternative for individuals with gluten intolerance, allowing them to savor their favorite flavors to the fullest."
}
