{
  "page_title": "Terms and Conditions of the Online Pastry Shop",
  "general_provisions_title": "Section 1 General Provisions",
  "general_provisions_content": [
    "1. These terms and conditions define the rules for making purchases in the online pastry shop.",
    "2. The online pastry shop is operated at the web address www.pastryshop.com.",
    "3. The online pastry shop is operated by Cukiernia Ltd., with headquarters in Warsaw, ul. Słoneczna 10.",
    "4. By making purchases in the online pastry shop, the customer accepts these terms and conditions and the shop's privacy policy."
  ],
  "purchase_rules_title": "Section 2 Purchase Rules",
  "purchase_rules_content": [
    "1. The online pastry shop offers only pastry products.",
    "2. All prices stated in the online pastry shop are gross prices, including VAT.",
    "3. Orders can be placed in the online pastry shop 24 hours a day, all year round.",
    "4. The online pastry shop delivers throughout Poland.",
    "5. The online pastry shop delivers exclusively through courier companies.",
    "6. For orders exceeding 200 PLN gross, delivery is free of charge.",
    "7. In the event of a product being withdrawn from the online pastry shop's offer, orders placed before the withdrawal of the product will be fulfilled."
  ],
  "payment_title": "Section 3 Payments",
  "payment_content": [
    "1. The following forms of payment are accepted in the online pastry shop: debit/credit card, bank transfer, and cash on delivery.",
    "2. In the case of payment by bank transfer, the order will be fulfilled after the payment is credited to the online pastry shop's bank account.",
    "3. In the case of cash on delivery, payment for the order must be made to the courier upon delivery."
  ],
  "complaints_title": "Section 4 Complaints",
  "complaints_content": [
    "1. The customer has the right to lodge a complaint in the event of receiving a faulty or damaged product.",
    "2. Complaints should be submitted to the email address of the online pastry shop: complaints@pastryshop.com.",
    "3. The online pastry shop undertakes to consider complaints within 14 days of receiving the complaint.",
    "4. The online pastry shop undertakes to replace the product with a defect-free one or refund the money for the defective product in the event of a justified complaint."
  ],
  "final_provisions_title": "Section 5 Final Provisions",
  "final_provisions_content": [
    "1. The online pastry shop reserves the right to change these terms and conditions at any time, particularly due to changes in legal regulations or product availability.",
    "2. Any disputes arising from the sales agreement concluded between the online pastry shop and the customer will be settled by the court competent for the registered office of the online pastry shop.",
    "3. Matters not regulated in these terms and conditions shall be governed by the provisions of the Civil Code.",
    "4. These terms and conditions come into force on May 6, 2023."
  ],
  "privacy_title": "Section 6 Privacy Protection",
  "privacy_content": [
    "1. The online pastry shop complies with the privacy protection principles for customers and the provisions of the GDPR.",
    "2. Customers' personal data is processed solely for the purpose of order fulfillment and providing the highest quality of service.",
    "3. Customers' personal data is protected in accordance with the privacy policy of the online pastry shop and applicable legal regulations.",
    "4. The customer has the right to access, modify, and delete their personal data from the online pastry shop's database."
  ],
  "copyright_title": "Section 7 Copyright",
  "copyright_content": [
    "1. All content posted on the online pastry shop's website, including product photos and descriptions, is protected by copyright law.",
    "2. Commercial use of the content posted on the online pastry shop's website without the shop's consent is prohibited."
  ]
}