{
  "page_title": "Regulamin sklepu internetowego-cukierniczego",
  "general_provisions_title": "§1 Postanowienia ogólne",
  "general_provisions_content": [
    "1. Niniejszy regulamin określa zasady dokonywania zakupów w sklepie internetowym-cukierniczym.",
    "2. Sklep internetowy-cukierniczy prowadzony jest pod adresem internetowym www.cukiernia.pl.",
    "3. Sklep internetowy-cukierniczy jest prowadzony przez firmę Cukiernia Sp. z o.o., z siedzibą w Warszawie, ul. Słoneczna 10.",
    "4. Klient, dokonując zakupów w sklepie internetowym-cukierniczym, akceptuje niniejszy regulamin oraz politykę prywatności sklepu."
  ],
  "purchase_rules_title": "§2 Zasady dokonywania zakupów",
  "purchase_rules_content": [
    "1. W sklepie internetowym-cukierniczym oferowane są wyłącznie produkty cukiernicze.",
    "2. Wszystkie ceny podawane w sklepie internetowym-cukierniczym są cenami brutto, zawierającymi podatek VAT.",
    "3. Zamówienia w sklepie internetowym-cukierniczym można składać przez całą dobę, przez cały rok.",
    "4. Sklep internetowy-cukierniczy dokonuje dostaw na terenie całej Polski.",
    "5. Sklep internetowy-cukierniczy dokonuje dostaw wyłącznie za pośrednictwem firmy kurierskiej.",
    "6. W przypadku zamówień na kwotę powyżej 200 zł brutto, dostawa jest darmowa.",
    "7. W przypadku wycofania produktu z oferty sklepu internetowego-cukierniczego, zamówienia złożone przed wycofaniem produktu zostaną zrealizowane."
  ],
  "payment_title": "§3 Płatności",
  "payment_content": [
    "1. W sklepie internetowym-cukierniczym akceptowane są następujące formy płatności: karta płatnicza, przelew bankowy oraz płatność za pobraniem.",
    "2. W przypadku wyboru płatności przelewem bankowym, zamówienie zostanie zrealizowane po zaksięgowaniu wpłaty na rachunku bankowym sklepu internetowego-cukierniczego.",
    "3. W przypadku wyboru płatności za pobraniem, należność za zamówienie należy uiścić kurierowi w momencie dostarczenia zamówienia."
  ],
  "complaints_title": "§4 Reklamacje",
  "complaints_content": [
    "1. Klient ma prawo do złożenia reklamacji w przypadku dostarczenia wadliwego lub uszkodzonego produktu.",
    "2. Reklamacje należy składać na adres e-mail sklepu internetowego-cukierniczego: reklamacje@cukiernia.pl.",
    "3. Sklep internetowy-cukierniczy zobowiązuje się do rozpatrzenia reklamacji w ciągu 14 dni od otrzymania reklamacji.",
    "4. Sklep internetowy-cukierniczy zobowiązuje się do wymiany produktu na wolny od wad lub do zwrotu pieniędzy za wadliwy produkt w przypadku uzasadnionej reklamacji."
  ],
  "final_provisions_title": "§5 Postanowienia końcowe",
  "final_provisions_content": [
    "1. Sklep internetowy-cukierniczy zastrzega sobie prawo do zmiany niniejszego regulaminu w każdym czasie, w szczególności ze względu na zmiany w przepisach prawa lub dostępności produktów.",
    "2. Wszelkie spory wynikłe z umowy sprzedaży zawartej między sklepem internetowym-cukierniczym a Klientem będą rozstrzygane przez sąd właściwy dla siedziby sklepu internetowego-cukierniczego.",
    "3. W sprawach nieuregulowanych w niniejszym regulaminie stosuje się przepisy Kodeksu Cywilnego.",
    "4. Niniejszy regulamin wchodzi w życie z dniem 06.05.2023 r."
  ],
  "privacy_title": "§6 Ochrona prywatności",
  "privacy_content": [
    "1. Sklep internetowy-cukierniczy przestrzega zasad ochrony prywatności Klientów oraz przepisów RODO.",
    "2. Dane osobowe Klientów są przetwarzane wyłącznie w celu realizacji zamówień oraz zapewnienia najwyższej jakości obsługi.",
    "3. Dane osobowe Klientów są chronione zgodnie z polityką prywatności sklepu internetowego-cukierniczego oraz obowiązującymi przepisami prawa.",
    "4. Klient ma prawo do wglądu, modyfikacji oraz usunięcia swoich danych osobowych z bazy sklepu internetowego-cukierniczego."
  ],
  "copyright_title": "§7 Prawa autorskie",
  "copyright_content": [
    "1. Wszystkie treści zamieszczone na stronie sklepu internetowego-cukierniczego, w tym zdjęcia i opisy produktów, podlegają ochronie prawem autorskim.",
    "2. Wykorzystywanie treści zamieszczonych na stronie sklepu internetowego-cukierniczego w celach komercyjnych bez zgody sklepu jest zabronione."
  ]
}